frontend/controllers/PelangganController.php

SELECT * FROM `kecamatan` WHERE `kabupaten_id`='1377'
---
    public function actionGet() {

            $request = Yii::$app->request;
            $obj = $request->post('obj');
            $value = $request->post('value');
            $id = null;
            $name = null;
            echo $obj;
            switch ($obj) {
                case 'provinsi_id':
                    $data = Kabupaten::find()->where([$obj => $value])->all();
                    $id = 'kabupaten_id';
                    $name = 'nama';
                    break;
                case 'kabupaten_id':
                    $data = Kecamatan::find()->where([$obj => $value])->all();