frontend/controllers/PembelianController.php

SELECT * FROM `pelanggan` WHERE `user_id`=19
SELECT * FROM `toko` WHERE `pelanggan_id`=13
---
    public function actionViewPenjual() {
        $pelanggan = Pelanggan::find()->where(['user_id' => Yii::$app->user->identity->id])->one();
        $toko = Toko::find()->where(['pelanggan_id' => $pelanggan->pelanggan_id])->one();