frontend/controllers/ProdukController.php

SELECT * FROM `rating_produk` WHERE `produk_id`='15' ORDER BY `rating_id` DESC LIMIT 7
SELECT * FROM `pelanggan` WHERE `user_id`=10
SELECT SUM(rating_produk) FROM `rating_produk` WHERE `produk_id`='15'
INSERT INTO `rating_produk` (`rating_produk`, `komentar`, `produk_id`, `pelanggan_id`) VALUES (4.5, '', 15, 10)
SELECT EXISTS(SELECT * FROM `produk` WHERE `produk_id`='15')
SELECT EXISTS(SELECT * FROM `pelanggan` WHERE `pelanggan_id`=10)
---
    public function actionView($id) {
        if (!Yii::$app->user->isGuest) {
            $ratingproduks = RatingProduk::find()->where(['produk_id' => $id])->orderBy(['rating_id' => SORT_DESC])->limit(7)->all();

            $sql = "SELECT COUNT(rating_produk.rating_produk) FROM rating_produk JOIN produk ON produk.`produk_id` = rating_produk.`produk_id` where rating_produk.produk_id = " . $id;
            $count = Yii::$app->db->createCommand($sql)->queryScalar();
            $sum = (new Query())->select(['rating_produk.rating_produk'])->from('rating_produk')->where(['produk_id' => $id])->sum('rating_produk');
            if ($count == 0) {
                $rating = 0;
            } else {
                $rating = round($sum / $count, 1);
            }

            $ratingproduk = new RatingProduk();
            $pelanggan = Pelanggan::find()->where(['user_id' => Yii::$app->user->identity->id])->one();
            if ($ratingproduk->load(Yii::$app->request->post())) {
                $ratingproduk->produk_id = $id;
                $ratingproduk->pelanggan_id = $pelanggan->pelanggan_id;
                $ratingproduk->save();
                $ratingproduk = new RatingProduk();
            }
            $dataProvider = new ActiveDataProvider(
                    [
                'query' => RatingProduk::find()->where(['produk_id' => $id]),
                'pagination' => [
                    'pageSize' => 10
                ]
                    ]
            );

            return $this->render('view', [
                        'model' => $this->findModel($id),
                        'rating' => $rating,
                        'ratingproduk' => $ratingproduk,
                        'dataProvider' => $dataProvider,
                        'ratingproduks' => $ratingproduks,
            ]);

SELECT * FROM `produk` WHERE `produk_id`='15'
---
    protected function findModel($id) {
        if (($model = Produk::findOne($id)) !== null) {