frontend/controllers/TokoController.php

SELECT * FROM `pelanggan` WHERE `user_id`=10
SELECT * FROM `toko` WHERE `pelanggan_id`=10
---
    public function actionIndexSaya() {
//        $searchModel = new TokoSearch();
        $pelanggan = Pelanggan::find()->where(['user_id' => Yii::$app->user->identity->id])->one();
        $toko = Toko::find()->where(['pelanggan_id' => $pelanggan->pelanggan_id])->one();

SELECT * FROM `rating_toko` WHERE `toko_id`='4' ORDER BY `rating_id` DESC LIMIT 7
SELECT * FROM `toko` WHERE `toko_id`='4'
---
    public function actionTokoSaya($id) {
        $ratingtokos = RatingToko::find()->where(['toko_id' => $id])->orderBy(['rating_id' => SORT_DESC])->limit(7)->all();

        $sql = "SELECT COUNT(rating_toko.`rating_toko`) FROM rating_toko JOIN toko ON toko.`toko_id` = rating_toko.`toko_id` where rating_toko.toko_id = " . $id;
        $count = Yii::$app->db->createCommand($sql)->queryScalar();
        $sum = (new \yii\db\Query())->select(['rating_toko.rating_toko'])->from('rating_toko')->where(['toko_id' => $id])->sum('rating_toko');
        if ($count == 0) {
            $rating = 0;
        } else {
            $rating = round($sum / $count, 1);
        }

        $produk = new Produk();
        $toko = Toko::find()->where(['toko_id' => $id])->one();

SELECT * FROM `rating_toko` WHERE `toko_id`='4' ORDER BY `rating_id` DESC LIMIT 7
SELECT * FROM `toko` WHERE `toko_id`='4'
SELECT * FROM `pelanggan` WHERE `user_id`=10
---
    public function actionView($id) {
        if (!Yii::$app->user->isGuest) {
            $ratingtokos = RatingToko::find()->where(['toko_id' => $id])->orderBy(['rating_id' => SORT_DESC])->limit(7)->all();

            $sql = "SELECT COUNT(rating_toko.`rating_toko`) FROM rating_toko JOIN toko ON toko.`toko_id` = rating_toko.`toko_id` where rating_toko.toko_id = " . $id;
            $count = Yii::$app->db->createCommand($sql)->queryScalar();
            $sum = (new \yii\db\Query())->select(['rating_toko.rating_toko'])->from('rating_toko')->where(['toko_id' => $id])->sum('rating_toko');
            if ($count == 0) {
                $rating = 0;
            } else {
                $rating = round($sum / $count, 1);
            }
            $produk = new Produk();
            $toko = Toko::find()->where(['toko_id' => $id])->one();
            $produks = Produk::find()->where(['toko_id' => $toko->toko_id]);

            $dataProvider = new ActiveDataProvider(
                    [
                'query' => $produks,
                'pagination' => [
                    'pageSize' => 10
                ]
                    ]
            );

            $ratingtoko = new RatingToko();
            $pelanggan = Pelanggan::find()->where(['user_id' => Yii::$app->user->identity->id])->one();

SELECT * FROM `rating_toko` WHERE `toko_id`='4' ORDER BY `rating_id` DESC LIMIT 7
---
                        'dataProviders' => $dataProviders,
            ]);
        } else {
            $ratingtokos = RatingToko::find()->where(['toko_id' => $id])->orderBy(['rating_id' => SORT_DESC])->limit(7)->all();

SELECT * FROM `toko` WHERE `toko_id`='4'
---
                $rating = round($sum / $count, 1);
            }
            $produk = new Produk();
            $toko = Toko::find()->where(['toko_id' => $id])->one();