frontend/views/produk/_form.php

SELECT * FROM `kategori`
---

    <?php $form = ActiveForm::begin(['options'=>['enctype' => 'multipart/form-data']]); ?>

    <?= $form->field($model, 'kategori_id')->dropDownList(ArrayHelper::map(Kategori::find()->asArray()->all(), 'kategori_id', 'kategori_name'), ['prompt'=>'-Select Kategori-']) ?>