frontend/views/produk/view.php

                <?= Html::a('Beli', ['beli', 'id' => $model->produk_id], ['class' => 'btn btn-danger']) ?>
                <?php
            } else {
                $pelanggan = Pelanggan::find()->where(['user_id' => Yii::$app->user->identity->id])->one();
                $pemilik_toko = Toko::find()->where(['pelanggan_id' => $pelanggan->pelanggan_id])->one();
                $toko = Toko::findOne($model->toko_id);
---
SELECT * FROM `pelanggan` WHERE `user_id`=10
SELECT * FROM `toko` WHERE `pelanggan_id`=10
SELECT * FROM `toko` WHERE `toko_id`=4