frontend/views/site/register.php

            <?= $form->field($model, 'email') ?>
            <?= $form->field($model, 'pelanggan_nama') ?>
            <?= $form->field($model, 'pelanggan_notelpon') ?>
            <?=
            $form->field($model, 'pelanggan_provinsi')->dropDownList(
                    ArrayHelper::map(Provinsi::find()->all(), 'provinsi_id', 'nama'), [
                'prompt' => Yii::t('app', 'Select Province'),
                'id' => 'provinsi_id',
                'class' => 'dependent-input form-control',
                'data-next' => 'kabupaten_id'
            ])
---
SELECT * FROM `provinsi`